[33mf34541f[m[33m ([m[1;36mHEAD[m[33m -> [m[1;32mmain[m[33m, [m[1;31morigin/main[m[33m, [m[1;31morigin/HEAD[m[33m)[m 优化地图loader
[33m8d65195[m 优化地图loader
[33m724816c[m 优化地图loader
[33m7f45a0e[m 优化地图loader
[33m512aa27[m 优化地图功能
[33mfd41299[m 优化地图功能
[33mce67178[m 修复api
[33md6a869d[m multi-tools-2
[33mac45071[m multi-tools
[33mded7e6e[m 完善对话体验
[33m58251a2[m 完善对话体验
[33m1dddc75[m 优化对话框样式
[33mcb65b21[m 不用流式输出了
[33m661e688[m 增加输出token
[33mda921b5[m 连续对话gemini
[33mc0df0e2[m 联网gemini
[33m7a36729[m https
[33m6682ad7[m 保持连续对话
[33m0b952ad[m 保持连续对话
[33m325386c[m 修改geminimap
[33mabc9b59[m 修改谷歌地图gemini
[33m5fcfcfc[m google_map
[33m4287f87[m 天气
[33mfead4a8[m 集成天气信息
[33m5dae548[m 集成天气信息
[33m128aa0c[m 深化blog模板，插入mermaid
[33mbb522a1[m 优化文件
[33m649042c[m 加入评论
[33m04c8fb5[m 加入评论
[33m035573a[m 更新竞品项目
[33me90a41a[m 更新竞品项目
[33m8ebb6b3[m 更新竞品项目
[33ma3d3e60[m 更新竞品项目
[33m3c114fd[m 旅行地图加入amadeus
[33m0211ee5[m 旅行地图加入amadeus
[33m99e2f94[m 旅行地图加入了去过的、危险的、想去的
[33mfe523c1[m 旅行地图加入了去过的、危险的、想去的
[33mf3b083b[m 尝试增加去过的地方
[33m767d3db[m 加入谷歌地图
[33m4ab5d8a[m 增加谷歌地图
[33m0063d97[m 修改酒店查找
[33me25cb10[m 修改酒店查找
[33m629a8b9[m 修改酒店查找
[33mc3a1986[m 修改酒店查找
[33me7616ef[m 修改酒店查找
[33m7869ee0[m 使用orama搜索
[33m8788b34[m 使用orama搜索
[33ma7c354f[m 导航优化
[33mf3c32a9[m 换成minisearch
[33m30a9a8d[m 找回谷歌搜素
[33m440851d[m 回溯到添加高德地图的版本
[33m6d6a4c6[m 实现高德地图组件
[33m00b144c[m 实现高德地图组件
[33m39f3b21[m 实现高德地图功能
[33m5a7263e[m 实现地图加点和连线
[33m9205270[m 分离对话和地图
[33m579c7b5[m 尝试
[33mab6cd7f[m 创建路线
[33mf0bc7f8[m 创建路线
[33mfd8f344[m 创建图片组件
[33mc770ddd[m 编写亚美尼亚三国
[33me017af5[m 修改环境变量
[33m7bcce89[m 修改环境变量
[33m79c804d[m 修改环境变量
[33mb3028d3[m 增加亚美尼亚
[33m6adaaeb[m 增加亚美尼亚
[33me6768ae[m 增加地图
[33md4bf0db[m 尝试地球
[33m3b92bdf[m 更新 .gitignore 并移除已追踪的忽略文件
[33mff4d503[m 更新 .gitignore 并移除已追踪的忽略文件
[33m41227a6[m 增加mapbpx
[33mab9d295[m 增加mapbpx
[33mc3093bf[m 修ai助手
[33m5deda48[m 修md
[33mb715eed[m 修md
[33m67d4c51[m 修md
[33m950a948[m 修正对话功能
[33m7e57d3f[m 修正对话功能
[33mc15a998[m 修正对话功能
[33m913e161[m 修正对话功能
[33mf565e53[m 修正对话功能
[33m9e3078d[m 修正对话功能
[33m178bce0[m 增加对话功能
[33mdd4591b[m 增加对话功能
[33m19e77fb[m 尝试接入cloudflare并加入环境变量
[33m8264831[m 尝试接入cloudflare并加入环境变量
[33mf0530fc[m 尝试接入cloudflare并加入环境变量
[33m895dd07[m 尝试接入cloudflare并加入环境变量
[33m61c1af7[m 尝试接入cloudflare
[33mc4c1af3[m 尝试接入cloudflare
[33me542dd3[m 尝试接入cloudflare
[33m913c857[m 尝试接入cloudflare
[33m199a24c[m 增加地图功能
[33m6c53616[m 增加地图功能
[33mfb043a5[m 增加地图功能
[33m7b9068b[m 增加地图功能
[33m926ee48[m 增加地图功能
[33ma1cd36a[m 加入视频背景
[33m203d194[m 初步规划页面
[33m13ed2c2[m 修正algolia
[33maac082d[m 修正algolia
[33m67e9910[m 修正algolia
[33mc76d8f4[m 初步改进页面 commit
[33m9473626[m 初步改进页面 commit
[33m3ade887[m 初步改进页面 commit
[33m05a6fa4[m 初步改进页面 commit
[33mfe260fe[m 初步改进页面 commit
[33mf9880a4[m 初步改进页面 commit
[33md2fca1d[m 初步改进页面 commit
[33mf8f6aa3[m 2 commit
[33m3b03588[m first commit
